-- конфигурационный файл для плагина аффектов (affects.lua)
-- good - позитивные аффекты
-- bad - негативные аффекты

-- цвет аффектов, палитра 256 цветов
colors = { good_active=10, good_inactive=2, bad_active=9, bad_inactive=1 }

-- Аффекты, которые нужно отображать
good_affects = {
{ id = "valor", name = "Доблесть" },
{ id = "magic_shield", name = "Волшебный щит" },
{ id = "sanctification", name = "Освящение" },
{ id = "defense", name = "Защита" },
{ id = "fogging", name = "Затуманивание" },
{ id = "strength", name = "Сила" },
{ id = "stone_skin", name = "Каменная кожа" },
{ id = "quick_recovery", name = "Быстрое восстановление" },
{ id = "flight", name = "Полет" },
{ id = "detect", name = "Детект" },
}

bad_affects = {
{ id = "thirst", name = "Жажда" },
{ id = "hunger", name = "Голод" },
{ id = "seine", name = "Сеть" },
{ id = "blindness", name = "Слепота" },
{ id = "stupor", name = "Оцепенение" },	
}

triggers = {
{ key = "^Вас мучает жажда.", on="thirst" },
{ key = "^Вы не чувствуете жажды.", off="thirst" },
{ key = "^Вы голодны.", on="hunger" },
{ key = "^Вы наелись.", off="hunger" },
{ key = "^Боги одарили вас своей улыбкой.", on="valor" },
{ key = "^Вы почувствовали себя менее доблестно.", off="valor" },
{ key = "^Сверкающий щит вспыхнул вокруг вас и угас.", on="magic_shield" },
{ key = "^Ваш волшебный щит рассеялся.", off="magic_shield" },
{ key = "^Белая аура мгновенно окружила вас.", on="sanctification" },
{ key = "^Белая аура вокруг вашего тела угасла.", off="sanctification" },
{ key = "^Вы почувствовали вокруг себя невидимую защиту.", on="defense" },
{ key = "^Вы почувствовали себя менее защищенно.", off="defense" },
{ key = "^Ваше тело стало прозрачным, как туман.", on="fogging" },
{ key = "^Ваши очертания приобрели отчетливость.", off="fogging" },
{ key = "^Вы почувствовали себя сильнее.", on="strength" },
{ key = "^Вы чувствуете себя немного слабее.", off="strength" },
{ key = "^Вы стали менее чувствительны к ударам.", on="stone_skin" },
{ key = "^Ваша кожа вновь стала мягкой и бархатистой.", off="stone_skin" },
{ key = "^Вас наполнила живительная сила.", on="quick_recovery" },
{ key = "^Живительная сила покинула вас.", off="quick_recovery" },
{ key = "^Вы медленно поднялись в воздух.", on="flight" },
{ key = "^Вы приземлились на землю.", off="flight" },
{ key = "^Ваши глаза приобрели золотистый оттенок.", on="detect" },
{ key = "^Вы не в состоянии больше видеть невидимых.", off="detect" },
{ key = "^Вас покрыла невидимая паутина!", on="seine" },
{ key = "^Магическая сеть, покрывавшая вас, исчезла.", off="seine" },
{ key = "^Вы ослепли!", on="blindness" },
{ key = "^Вы вновь можете видеть.", off="blindness" },
{ key = "^Вы замерли на месте, не в силах пошевельнуться.", on="stupor" },
{ key = "^К вам вернулась способность двигаться.", off="stupor" },
}
